shock-tube-riemann/environment/case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField
{
    type        zonal;

    defaultValue    3.528;

    zones
    {
        rightState
        {
            type            box;

            box             (0 -1 -1) (5 1 1);

            value           0.571;
        }
    }
}

boundaryField
{
    sides
    {
        type            zeroGradient;
    }

    empty
    {
        type            empty;
    }
}

// ************************************************************************* //
