shock-tube-riemann/environment/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-5 -0.05 0)      // 0
    ( 5 -0.05 0)      // 1
    ( 5  0.05 0)      // 2
    (-5  0.05 0)      // 3
    (-5 -0.05 0.1)    // 4
    ( 5 -0.05 0.1)    // 5
    ( 5  0.05 0.1)    // 6
    (-5  0.05 0.1)    // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1000 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    sides
    {
        type patch;
        faces
        (
            (0 3 7 4)
            (1 2 6 5)
        );
    }
    empty
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
            (0 1 5 4)
            (3 2 6 7)
        );
    }
);

// ************************************************************************* //
